#解决新北京地铁问题
#创建：荣婉
#日期：2018.4.11
n1,n2,n3=map(int,input().split())    #用split函数单行输入三个分离整数
a1=0                          #用a1、a2、a3分别表示第1、2、3天的乘车总价
a2=0
a3=0
for i in range(1,n1+1):        #输入n1行数据，每行输入第一天单次乘车价格
    i1=int(input())
    a1=a1+i1               #将每一次的乘车价格加到a1，得到第一天的乘车总价
for i in range(1,n2+1):
    j1=int(input())
    a2=a2+j1
for i in range(1,n3+1):
    k1=int(input())
    a3=a3+k1
c1=a1+a2+a3             #将a1、a2、a3相加得到不买定期票的乘车费c1
c2=a1+a2+20              #只买第三天定期票的乘车费c2
c3=a1+a3+20              
c4=a2+a3+20
c5=a1+30                 #只买第2、3天的两天定期票的乘车费c5
c6=a3+30
c7=40                    #买三天定期票时的乘车费c7
s=[c1,c2,c3,c4,c5,c6,c7]     #将7中方案的消费加进列表s中
c=min(s)                 #用min函数取s中元素的最小值
print(c)                   #得到最小消费c